<a href="https://colab.research.google.com/github/Ralph2g/Pandas_course/blob/master/9_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd

df_left = pd.DataFrame(
                      {'X': ['x0', 'x1', 'x2', 'x3'],
                        'W': ['w0', 'w1', 'w2', 'w3'], 
                        'Y': ['y0', 'y1', 'y2', 'y3'],
                       'Mix': ['y2','y3','a2','a3'] },
                       index=[0,1,2,3])
df_left

    X   W   Y Mix
0  x0  w0  y0  y2
1  x1  w1  y1  y3
2  x2  w2  y2  a2
3  x3  w3  y3  a3

In [7]:
df_right = pd.DataFrame(
                       {'Z': ['z2', 'z3', 'z4', 'z5'],
                         'A': ['a2', 'a3', 'a4', 'a5'], 
                         'Y': ['y2', 'y3', 'y4', 'y5']},
                        index=[2,3,4,5])
df_right

    Z   A   Y
2  z2  a2  y2
3  z3  a3  y3
4  z4  a4  y4
5  z5  a5  y5

In [8]:
pd.merge(df_left, df_right)

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [9]:
# Unimos nuestros dataframes y retorna uno nuevo donde coincidieron las cols
pd.merge(df_left,df_right)

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [16]:
# Se tienen que especificar los arametros si queremos hacer el merge con una buena practica
pd.merge(df_left,df_right,how='inner',on='Y')

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [18]:
# aqui especificamos que columnas una columna Base en este caso es MIX
# en right on va a buscar donde coincide con la columna Y
# devuelve el dataframe en la pocisión donde coincidieron ambas columnas

# Como la columna Y es se repite en ambos DF los muestra con un subindice

pd.merge(df_left,df_right,how='inner',left_on='Mix',right_on='Y')

    X   W Y_x Mix   Z   A Y_y
0  x0  w0  y0  y2  z2  a2  y2
1  x1  w1  y1  y3  z3  a3  y3

In [19]:
# Hagamos lo mismo pero viendo que elementos de la columna A se repiten en mi
# Columna Y
pd.merge(df_left,df_right,how='inner',left_on='Mix',right_on='A')

    X   W Y_x Mix   Z   A Y_y
0  x2  w2  y2  a2  z2  a2  y2
1  x3  w3  y3  a3  z3  a3  y3

![](http://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png)

In [ ]:
# Vamos a simplificar nuestro Dataframe con las siguientes variables

In [22]:
df_left = pd.DataFrame(
                      {'X': ['x0', 'x1', 'x2', 'x3'],
                        'W': ['w0', 'w1', 'w2', 'w3'], 
                        'Y': ['y0', 'y1', 'y2', 'y3'] },
                       index=[0,1,2,3])
df_right = pd.DataFrame(
                       {'Z': ['z2', 'z3', 'z4', 'z5'],
                         'A': ['a2', 'a3', 'a4', 'a5'], 
                         'Y': ['y2', 'y3', 'y4', 'y5']},
                        index=[2,3,4,5])

In [23]:
pd.merge(df_left,df_right,how='inner',on='Y')

    X   W   Y   Z   A
0  x2  w2  y2  z2  a2
1  x3  w3  y3  z3  a3

In [24]:
# Dejamos el df de la izq intacto y se le añaden los elementos del df de la derecha

pd.merge(df_left,df_right,how='left',on='Y')

    X   W   Y    Z    A
0  x0  w0  y0  NaN  NaN
1  x1  w1  y1  NaN  NaN
2  x2  w2  y2   z2   a2
3  x3  w3  y3   z3   a3

In [25]:
# Lo mismo pero ahora inverso

pd.merge(df_left,df_right,how='left',on='Y')

    X   W   Y    Z    A
0  x0  w0  y0  NaN  NaN
1  x1  w1  y1  NaN  NaN
2  x2  w2  y2   z2   a2
3  x3  w3  y3   z3   a3

In [26]:
# Hacemos el merge Outer donde nos respeta tanto elementos de la der e izq

pd.merge(df_left,df_right,how='outer',on='Y')

     X    W   Y    Z    A
0   x0   w0  y0  NaN  NaN
1   x1   w1  y1  NaN  NaN
2   x2   w2  y2   z2   a2
3   x3   w3  y3   z3   a3
4  NaN  NaN  y4   z4   a4
5  NaN  NaN  y5   z5   a5

In [27]:
df_left = pd.DataFrame({
    'X': ['x0', 'x1', 'x2', 'x3'],
    'W': ['w0', 'w1', 'w2', 'w3'], 
    'Y': ['y0', 'y1', 'y2', 'y3'],
    'A': ['a0', 'a1', 'a2', 'a3'],
})
df_left

    X   W   Y   A
0  x0  w0  y0  a0
1  x1  w1  y1  a1
2  x2  w2  y2  a2
3  x3  w3  y3  a3

In [28]:
# para cambiar los sufijos de las columnas repetidas se hace lo siguiente
df_right

    Z   A   Y
2  z2  a2  y2
3  z3  a3  y3
4  z4  a4  y4
5  z5  a5  y5

In [31]:
pd.merge(df_left,df_right,how='outer',on='A',suffixes=['_left','right'])

     X    W Y_left   A    Z Yright
0   x0   w0     y0  a0  NaN    NaN
1   x1   w1     y1  a1  NaN    NaN
2   x2   w2     y2  a2   z2     y2
3   x3   w3     y3  a3   z3     y3
4  NaN  NaN    NaN  a4   z4     y4
5  NaN  NaN    NaN  a5   z5     y5